Revit 2022 API
Connector.Direction Property
The direction of the connector.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)
Syntax
C#
public FlowDirectionType Direction { get; }
Visual Basic
Public ReadOnly Property Direction As FlowDirectionType
	Get
Visual C++
public:
property FlowDirectionType Direction {
	FlowDirectionType get ();
}
Remarks
Instantaneous direction of this connector, calculated according to system.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.InvalidOperationException |  Thrown when the connector's domain is not DomainHvac or DomainPiping.
Autodesk.Revit.Exceptions.InvalidOperationException |  Thrown on failure to get direction.
See Also
Connector Class
Autodesk.Revit.DB Namespace